Revit 2025 API
FlowConversionMode Enumeration
 Enumerated type listing possible flow conversion modes for piping calculations.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum FlowConversionMode
Public Enumeration FlowConversionMode
public enum class FlowConversionMode
type FlowConversionMode
Members
Member name | Value | Description
Valves | 0 |  Predominantly flush valves.
Tanks | 1 |  Predominantly flush tanks.
Invalid | -1 |  A default value which should not be assigned to system types.
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace